#include "buffers.h"

/***********************************************************************************************************/
//Вспомогательный класс для упаковки/распаковки потока по упрощённому алгоритму Range Coder 32-bit
/***********************************************************************************************************/

buffers::buffers(){
  content=NULL;
  size=0;
  state=0;
  locked=true;
}

buffers::~buffers(){
  content=NULL;
  size=0;
  state=0;
  locked=true;
}

/***********************************************************************************************************/
